**** Purchases
| Quantity | Item                                   | Price + S&H (USD) | Price per unit (USD) | Date Received    |
|----------+----------------------------------------+-------------------+----------------------+------------------|
|        1 | Barebones Dell R710                    |             92.31 |                92.31 | <2019-05-18 Sat> |
|        6 | 2.5" HDD Tray / Caddy                  |             26.91 |                4.485 | <2019-05-18 Sat> |
|        2 | Intel Xeon x5660 CPUs                  |             29.98 |                14.99 | <2019-05-17 Fri> |
|        2 | Dell Savvio 600GB 10k.6 SAS HDD        |             39.98 |                19.99 | <2019-05-22 Wed> |
|        1 | New Dell Perc H200 SAS/SATA Controller |             37.88 |                37.88 | <2019-05-17 Fri> |
|        4 | HGST 900GB 10k SAS HDD                 |             86.88 |                21.72 |                  |
|        8 | 16GB DDR3-1333 Reg ECC DIMM            |            272.59 |             34.07375 | <2019-05-18 Sat> |
|----------+----------------------------------------+-------------------+----------------------+------------------|
|          |                                        |            586.53 |                      |                  |
#+TBLFM: $4=$3/$1::@9$3=vsum(@I..@II)

**** Prebuilt prices
| Title                                                                           | Price (USD) | S&H (USD) | Cost to Upgrade (USD) | Final Price (USD) | Form Factor | CPU              | Number of CPUs | CPU Cores | Total CPU Cores | Memory Module Size (GB) | Number of Memory Modules | Total Memory Capacity (GB) | HDD Type | HDD Size (GB) | Number of HDD | Total Disk Capacity (GB) | Disk Controller | Number of Missing Drive Caddies | iDrac Enterprise | Power Supply Wattage | Number of Power Supplies | Seller          | Link                                                                                                                                                                                                 |
|---------------------------------------------------------------------------------+-------------+-----------+-----------------------+-------------------+-------------+------------------+----------------+-----------+-----------------+-------------------------+--------------------------+----------------------------+----------+---------------+---------------+--------------------------+-----------------+---------------------------------+------------------+----------------------+--------------------------+-----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Dell PowerEdge R710 Server - 2 L5520 Procs - Perc 6/i RAID - Dual Pwr - No Mem  |          85 |         0 |                   356 |               441 | SFF         | Intel Xeon L5520 |              2 |         4 |               8 |                         |                        0 |                          0 |          |               |             0 |                        0 | Perc 6/i        |                               8 | No               |                  870 |                        2 | arcassales      | https://www.ebay.com/itm/Dell-PowerEdge-R710-Server-2-L5520-Procs-Perc-6-i-RAID-Dual-Pwr-No-Mem/173868976631?hash=item287b6609f7:g:TDgAAOSwQ7lcYesQ#viTabs_0                                         |
| Dell PowerEdge R710 Server - 2 L5520 Procs - Perc 6/i RAID - Dual Pwr - 8GB Mem |         100 |         0 |                   356 |               456 | SFF         | Intel Xeon L5520 |              2 |         4 |               8 |                       4 |                        2 |                          8 |          |               |             0 |                        0 | Perc 6/i        |                               8 | No               |                  870 |                        2 | arcassales      | https://www.ebay.com/itm/Dell-PowerEdge-R710-Server-2-L5520-Procs-Perc-6-i-RAID-Dual-Pwr-8GB-Mem/183769531146?hash=item2ac984830a:g:TDgAAOSwQ7lcYesQ#viTabs_0                                        |
| Dell PowerEdge R710 3.5" Virtualization Server 2x 2.53GHz E5540 8GB iDRAC       |      140.95 |         0 |                   406 |            546.95 | LFF         | Intel Xeon E5540 |              2 |         4 |               8 |                       4 |                        2 |                          8 |          |               |             0 |                        0 | Perc 6/i        |                               6 | No               |                      |                        1 | savemyserver    | https://www.ebay.com/itm/Dell-PowerEdge-R710-3-5-Virtualization-Server-2x-2-53GHz-E5540-8GB-iDRAC/182859690340?hash=item2a93497164:g:IC0AAOSw-09Z801r#viTabs_0                                       |
| Dell Poweredge R710 3.5″ 2x X5570 2.93ghz Quad Core / NoRam / Perc6i / 2x PSU   |       74.99 |     63.13 |                   366 |            504.12 | LFF         | Intel Xeon X5570 |              2 |         4 |               8 |                         |                        0 |                          0 |          |               |             0 |                        0 | Perc 6/i        |                               6 | No               |                  870 |                        2 | garlandcomputer | https://www.ebay.com/itm/Dell-Poweredge-R710-3-5-2x-X5570-2-93ghz-Quad-Core-NoRam-Perc6i-2x-PSU/233212244460?hash=item364c8871ec:g:tRgAAOSwfVpYxEqx                                                  |
| Dell PowerEdge R710 12-Core Server  24GB RAM  2x300GB SAS  iDRAC6  PERC6i       |      197.95 |         0 |                   320 |            517.95 | SFF         | Intel Xeon E5649 |              2 |         6 |              12 |                       4 |                        6 |                         24 | SAS      |           300 |             2 |                      600 | Perc 6/i        |                               6 | No               |                      |                        2 | savemyserver    | https://www.ebay.com/itm/Dell-PowerEdge-R710-12-Core-Server-24GB-RAM-2x300GB-SAS-iDRAC6-PERC6i/172918861656?hash=item2842c46f58:g:UdAAAOSwX4dbX1-u#viTabs_0                                          |
| Dell Poweredge R710 Virtualization Server 2.66ghz 12 Cores 64gb 500gb 2xPSU     |      169.99 |     63.15 |                   364 |            597.14 | LFF         | Intel Xeon X5650 |              2 |         6 |              12 |                       4 |                       16 |                         64 | SATA     |           250 |             2 |                      500 | Perc 6/i        |                               4 | No               |                  570 |                        2 | garlandcomputer | https://www.ebay.com/itm/Dell-Poweredge-R710-Virtualization-Server-2-66ghz-12-Cores-64gb-500gb-2xPSU/372661691913?hash=item56c45e2609:g:bHEAAOSwLztbUfi5                                             |
| Dell PowerEdge R710 2x Intel Xeon E5620 2.4GHz 64GB DDR3 6x 3.5" HDD 2U Server  |      189.99 |     34.49 |                   406 |            630.48 | LFF         | Intel Xeon E5620 |              2 |         4 |               8 |                       4 |                       16 |                         64 |          |               |             0 |                        0 | Perc 6/i        |                               6 | No               |                      |                        2 | human-I-T       | https://www.ebay.com/itm/Dell-PowerEdge-R710-2x-Intel-Xeon-E5620-2-4GHz-64GB-DDR3-6x-3-5-HDD-2U-Server/312608483421?hash=item48c8eae85d:g:2PcAAOSwKHtc2e~i:sc:FedExHomeDelivery!98038!US!-1#viTabs_0 |
| Dell Poweredge R710 2 X SIX CORE 2.93GHZ X5670 24GB 6 X 2TB 12TB H700 SERVER    |             |     69.99 |                   248 |            317.99 | LFF         | Intel Xeon X5670 |              2 |         6 |              12 |                       4 |                        6 |                         24 | SAS      |          2000 |             6 |                    12000 | H700            |                               0 | Yes              |                  870 |                        2 | surplusa2z      | https://www.ebay.com/itm/Dell-Poweredge-R710-2-X-SIX-CORE-2-93GHZ-X5670-24GB-6-X-2TB-12TB-H700-SERVER/133047296055?hash=item1efa3ca037:g:UPAAAOSw7bla13v2                                            |
| Dell Google R710 SFF GB-7007 Gen II 12-Core 2.66GHz X5650 24GB H700 No 2.5" HDD |      239.99 |         0 |                   328 |            567.99 | SFF         | Intel Xeon x5650 |              2 |         6 |              12 |                       4 |                        6 |                         24 |          |               |             0 |                        0 | H700            |                               8 | No               |                  870 |                        2 | digitalmind2000 | https://www.ebay.com/itm/Dell-Google-R710-SFF-GB-7007-Gen-II-12-Core-2-66GHz-X5650-24GB-H700-No-2-5-HDD/382882549074?epid=1801409820&hash=item5925940d52:g:cSIAAOSwphhcpgne                          |
| Dell PowerEdge R710 Virtualization Server 2.4ghz 12-Cores 48gb 4x 300gb Perc6i  |      164.99 |     63.13 |                   280 |            508.12 | SFF         | Intel Xeon E5645 |              2 |         6 |              12 |                       4 |                       12 |                         48 | SAS      |           300 |             4 |                     1200 | Perc 6/i        |                               0 | Yes              |                  870 |                        2 | garlandcomputer | https://www.ebay.com/itm/Dell-PowerEdge-R710-Virtualization-Server-2-4ghz-12-Cores-48gb-4x-300gb-Perc6i/372627700342                                                                                 |
|                                                                                 |             |           |                       |                 0 |             |                  |                |           |               0 |                         |                          |                          0 |          |               |               |                        0 |                 |                                 |                  |                      |                          |                 |                                                                                                                                                                                                      |
#+TBLFM: $5=vsum($2..$4)::$10=$8 * $9::$13=$11 * $12::$17=$15 * $16

*** DONE Build an IBM X3650 M3 server for virtualization
   CLOSED: [2019-06-02 Sun 20:09]
Purchases
| Quantity | Price + S&H (USD) | Price per unit (USD) | Description                     |
|----------+-------------------+----------------------+---------------------------------|
|        1 |            108.60 |                108.6 | IBM 7945-AC1 SFF X3650 M3       |
|       16 |             43.44 |                2.715 | Hot swap drive trays            |
|        6 |            195.41 |            32.568333 | IBM 900GB 10K 2.5 SAS HDD       |
|        8 |             91.14 |              11.3925 | Samsung 8GB DDR3-1333 ECC RDIMM |
|        2 |             57.90 |                28.95 | Crucial BX500 240GB SATA SSD    |
|        1 |             21.99 |                21.99 | IBM ServeRaid M1015 SAS HBA     |
|----------+-------------------+----------------------+---------------------------------|
|          |            518.48 |                      |                                 |
#+TBLFM: $3=$2/$1::@8$2=vsum(@I..@II)

*** DONE Reformat IBM drives with 512 byte sectors
   CLOSED: [2019-06-05 Wed 13:12] DEADLINE: <2019-06-05 Wed> SCHEDULED: <2019-06-03 Mon>
   CLOCK: [2019-06-03 Mon 23:35]--[2019-06-05 Wed 13:12] => 37:37
The drives came formated with 528 byte sectors.
https://forums.servethehome.com/index.php?threads/how-to-reformat-hdd-ssd-to-512b-sector-size.4968/
ls /dev/sg[1-6] | xargs -l sg_format --six --format --size=512

*** TODO Build an R720 server for virtualization
Need another system with AES-NI to run pfsense.
Purchases
| Quantity | Price + S&H (USD) | Price per unit (USD) | Description                                                            |
|----------+-------------------+----------------------+------------------------------------------------------------------------|
|        1 |            364.90 | 364.9                | Dell PowerEdge R720 2x XEON 64GB RAM 2x 300GB SAS HDD 6x 1.2TB SAS HDD |
|----------+-------------------+----------------------+------------------------------------------------------------------------|
|          |             364.9 |                      |                                                                        |
#+TBLFM: $3=$2/$1::@3$2=vsum(@I..@II)
Configured drives into two VDs: one RAID1 (OS) containing the two 300GB drives and one RAID6 (data) containing all six of the 1.2TB drives.
Installed ProxMox VE on the "OS" logical drive.
Created a single partition out of the "data" logical drive and formatted it with ext4 fs.
Attempted to update firmware from lifecycle controller, bootable USB and individual update packages.  All failed.
Installed Docker CE and Portainer.
Created Monero mining container.

